## DataFrame基本操作

- ### 建構

In [2]:
import pandas as pd

    - 矩陣格式 (用list表示, 用columns設定欄位名稱)

In [6]:
df = pd.DataFrame([[1,2,3],[4,5,6], [7,8,9]], columns=['a','b','c'])

In [7]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

    - 字典格式

In [8]:
df = pd.DataFrame({'TW':[1,2,3,4], 'JP':[2,3,4,5], 'US':[4,5,6,7], 'UK':[6,7,8,9]})

In [9]:
df

   TW  JP  US  UK
0   1   2   4   6
1   2   3   5   7
2   3   4   6   8
3   4   5   7   9

- ### 探索資料

    - 取前五筆資料

In [10]:
df.head()

   TW  JP  US  UK
0   1   2   4   6
1   2   3   5   7
2   3   4   6   8
3   4   5   7   9

    - 取末五筆資料

In [11]:
df.tail()

   TW  JP  US  UK
0   1   2   4   6
1   2   3   5   7
2   3   4   6   8
3   4   5   7   9

    - 敘述統計

In [12]:
df.describe()

             TW        JP        US        UK
count  4.000000  4.000000  4.000000  4.000000
mean   2.500000  3.500000  5.500000  7.500000
std    1.290994  1.290994  1.290994  1.290994
min    1.000000  2.000000  4.000000  6.000000
25%    1.750000  2.750000  4.750000  6.750000
50%    2.500000  3.500000  5.500000  7.500000
75%    3.250000  4.250000  6.250000  8.250000
max    4.000000  5.000000  7.000000  9.000000

    - 查看空值

In [2]:
na_df = pd.DataFrame({'a':[1,2,3], 'b':[None,3,None]})
na_df

   a    b
0  1  NaN
1  2  3.0
2  3  NaN

In [32]:
na_df.isnull()

       a      b
0  False   True
1  False  False
2  False   True

    - 查看各欄位空值總數

In [33]:
na_df.isnull().sum()

a    0
b    2
dtype: int64

    - 查看各欄位非空值總數

In [34]:
na_df.count()

a    3
b    1
dtype: int64

    - 填補空值

In [25]:
na_df.fillna(0)

   a    b
0  1  0.0
1  2  3.0
2  3  0.0

    - 移除有空值的紀錄

In [6]:
na_df.dropna()

   a    b
1  2  3.0

    - 總資料筆數

In [60]:
df = pd.DataFrame({'TW':[1,2,3,4], 'JP':[2,3,4,5], 'US':[4,5,6,7]})

In [61]:
df

   TW  JP  US
0   1   2   4
1   2   3   5
2   3   4   6
3   4   5   7

In [62]:
len(df)

4

- ### 取得表格屬性

In [35]:
df = pd.DataFrame({'a':[1,2], 'b':[3,4]})

In [36]:
df

   a  b
0  1  3
1  2  4

    - 取得columns

In [37]:
df.columns

Index(['a', 'b'], dtype='object')

    - 取得index

In [38]:
df.index

RangeIndex(start=0, stop=2, step=1)

    - 取得值

In [39]:
df.values

array([[1, 3],
       [2, 4]], dtype=int64)

[--QUIZ--]

給定一df   
df = pd.DataFrame({'a':[1,2,3], 'b':[None, 1, 2], 'c': [None, None, 5]})   
1. 查看每一欄的空值數量各是多少   
2. 取得所有的欄位名稱
3. 將所有的空值取代為999

- ### 選取/修改資料

In [3]:
df = pd.DataFrame([['Tony', 100, 'A'], ['Tom', 50, 'F']], columns=['name', 'score', 'grade'])

In [44]:
df

   name  score grade
0  Tony    100     A
1   Tom     50     F

    - 選取欄位
        選取單一欄位的結果是Series

In [42]:
df['name']

0    Tony
1     Tom
Name: name, dtype: object

    - 選取複數欄位
        結果是DataFrame

In [45]:
df[['name', 'score']]

   name  score
0  Tony    100
1   Tom     50

    - 修改整個現有欄位

In [46]:
# 將兩個分數對調
# 指定的值可以是list, array, Series
# Series要注意index mapping
df['score'] = [50,100]
df

   name  score grade
0  Tony     50     A
1   Tom    100     F

    - loc/iloc
        使用index, column一起定位
        loc: 使用實際標籤名稱
        iloc: 使用索引值

In [48]:
df = pd.DataFrame([['Tony', 100, 'A'], ['Tom', 50, 'F'], ['Jane', 60, 'C'], ['Jack', 70, 'B']], 
                  columns=['name', 'score', 'grade'], index=['100','200','300','400'])
df

     name  score grade
100  Tony    100     A
200   Tom     50     F
300  Jane     60     C
400  Jack     70     B

In [50]:
# 找 index為 100 的資料
df.loc['100']

name     Tony
score     100
grade       A
Name: 100, dtype: object

In [51]:
# 找 index為 100, column為 name 的資料
df.loc['100', 'name']

'Tony'

In [52]:
# 修改該筆資料
df.loc['100', 'name'] = 'tony'
df

     name  score grade
100  tony    100     A
200   Tom     50     F
300  Jane     60     C
400  Jack     70     B

In [53]:
# 用分片的方式定位
df.iloc[1:, :2]

     name  score
200   Tom     50
300  Jane     60
400  Jack     70

In [55]:
# 不連續指定
df.iloc[:, [0,2]]

     name grade
100  tony     A
200   Tom     F
300  Jane     C
400  Jack     B

- ### 新增欄位

In [56]:
df = pd.DataFrame({'a':[1,2], 'b':[3,4]})
df

   a  b
0  1  3
1  2  4

In [57]:
df['c'] = [5,6]
df

   a  b  c
0  1  3  5
1  2  4  6

- ### 刪除資料

In [58]:
# 刪除紀錄
df.drop(1)

   a  b  c
0  1  3  5

In [59]:
# 刪除欄位
df.drop('c', axis=1)

   a  b
0  1  3
1  2  4

[--QUIZ--]

給定一df   
df = pd.DataFrame({'a':[1,2,None,4,5], 'b':[None, 1, 2, 3, None], 'c': [None, None, 5, 4, None]})

1. 總共有幾筆資料
2. 計算每個欄位的平均數
3. 從df分隔出兩個新的dataframe，將a,b欄位分配給df_x，c欄位分配給df_y